* 6
   
|   U,V |  I,A |   B,mT |   dI |  dB |         logI |      logB |        dlogI |        dlogB |        I^2 |         dI^2 |
|-------+------+--------+------+-----+--------------+-----------+--------------+--------------+------------+--------------|
|   8.9 | 0.10 |  123.9 | 0.01 | 0.1 |   -2.3025851 | 4.8194748 |          0.1 | 8.0710250e-4 | 0.31622777 |  0.015811388 |
|  23.7 | 0.26 |  316.6 | 0.01 | 0.1 |   -1.3470736 | 5.7576391 |  0.038461538 | 3.1585597e-4 | 0.50990195 | 9.8058068e-3 |
|  40.5 | 0.44 |  529.8 | 0.01 | 0.1 |  -0.82098055 | 6.2724996 |  0.022727273 | 1.8875047e-4 | 0.66332496 | 7.5377836e-3 |
|  52.9 | 0.58 |  686.4 | 0.01 | 0.1 |  -0.54472718 | 6.5314605 |  0.017241379 | 1.4568765e-4 | 0.76157731 | 6.5653216e-3 |
|  57.5 | 0.63 |  742.6 | 0.01 | 0.1 |  -0.46203546 | 6.6101575 |  0.015873016 | 1.3466200e-4 | 0.79372539 | 6.2994079e-3 |
|  70.9 | 0.78 |  889.6 | 0.01 | 0.1 |  -0.24846136 | 6.7907719 |  0.012820513 | 1.1241007e-4 | 0.88317609 | 5.6613851e-3 |
|  88.6 | 0.97 | 1005.9 | 0.01 | 0.1 | -0.030459207 | 6.9136379 |  0.010309278 | 9.9413461e-5 | 0.98488578 | 5.0767308e-3 |
| 106.2 | 1.16 | 1086.0 | 0.01 | 0.1 |   0.14842001 | 6.9902565 | 8.6206897e-3 | 9.2081031e-5 |  1.0770330 | 4.6423833e-3 |
| 113.9 | 1.24 | 1117.0 | 0.01 | 0.1 |   0.21511138 | 7.0184018 | 8.0645161e-3 | 8.9525515e-5 |  1.1135529 | 4.4901324e-3 |
#+TBLFM: $4=0.01::$5=0.1::$6=log($2)::$7=log($3)::$8=$4/$2::$9=$5/$3::$10=sqrt($2)::$11=$4/$10/2

f(x) = kx^n + b
k = 1310.85 +/- 41.85 (3.193%)
n = 0.5
b = -312.637 +/- 34.63 (11.08%)

B: 		=1310.85*sqrt($2)-312.637
delta_B:	=sqrt(34.63^2 + (1310.85^2 * 0.01^2) / (4 * $2) + $2 * (41.85^2))
* 7

U_0 = +10, K2 = 2
0.2A copper yes:
| U_24,d | I_m,A |     B, mT |   dA |        dB | U, nV | dU | u real talk |
|--------+-------+-----------+------+-----------+-------+----+-------------|
|      7 |  0.17 | 227.84030 | 0.01 | 41.829104 |   120 | 20 |        -120 |
|      6 |  0.34 | 451.71333 | 0.01 | 43.829992 |   160 | 20 |        -160 |
|      5 |  0.51 | 623.49715 | 0.01 | 46.655055 |   200 | 20 |        -200 |
|      5 |  0.62 | 719.52732 | 0.01 | 48.522224 |   200 | 20 |        -200 |
|      4 |  0.86 | 902.99528 | 0.01 | 52.492015 |   240 | 20 |        -240 |
|      4 |  1.08 | 1049.6383 | 0.01 | 55.951312 |   240 | 20 |        -240 |
|      3 |  1.23 | 1141.1660 | 0.01 | 58.210067 |   280 | 20 |        -280 |
#+TBLFM: $3=1310.85*sqrt($2)-312.637::$4=0.01::$5=sqrt(34.63^2 + (1310.85^2 * 0.01^2) / (4 * $2) + $2 * (41.85^2))::$6=($1-(+10))*40::$7=20::$8=-$6

U_0 = -2, K2 = 1
0.4A copper yes:
| U_24,d | I_m,A |     B, mT |   dA |        dB | U, nV | dU | u real talk |
|--------+-------+-----------+------+-----------+-------+----+-------------|
|      1 |  0.23 | 316.02458 | 0.01 | 42.294667 |   120 | 20 |        -120 |
|      5 |  0.40 | 516.41733 | 0.01 | 44.801801 |   280 | 20 |        -280 |
|      6 |  0.56 | 668.31332 | 0.01 | 47.505206 |   320 | 20 |        -320 |
|      8 |  0.65 | 744.20406 | 0.01 | 49.028064 |   400 | 20 |        -400 |
|     10 |  0.81 |   867.128 | 0.01 | 51.680982 |   480 | 20 |        -480 |
|     12 |  1.01 | 1004.7509 | 0.01 | 54.869905 |   560 | 20 |        -560 |
|     12 |  1.22 | 1135.2441 | 0.01 | 58.061898 |   560 | 20 |        -560 |
#+TBLFM: $3=1310.85*sqrt($2)-312.637::$4=0.01::$5=sqrt(34.63^2 + (1310.85^2 * 0.01^2) / (4 * $2) + $2 * (41.85^2))::$6=($1-(-2))*40::$7=20::$8=-$6

U_0 = -4, K2 = 1
0.6A copper yes:
| U_24,d | I_m,A |     B, mT |   dA |        dB | U, nV | dU | u real talk |
|--------+-------+-----------+------+-----------+-------+----+-------------|
|      2 |  0.23 | 316.02458 | 0.01 | 42.294667 |   240 | 20 |        -240 |
|      5 |  0.40 | 516.41733 | 0.01 | 44.801801 |   360 | 20 |        -360 |
|      8 |  0.55 | 659.51538 | 0.01 | 47.335241 |   480 | 20 |        -480 |
|     10 |  0.65 | 744.20406 | 0.01 | 49.028064 |   560 | 20 |        -560 |
|     13 |  0.81 |   867.128 | 0.01 | 51.680982 |   680 | 20 |        -680 |
|     15 |  1.00 |   998.213 | 0.01 | 54.713962 |   760 | 20 |        -760 |
|     17 |  1.21 |  1129.298 | 0.01 | 57.913390 |   840 | 20 |        -840 |
#+TBLFM: $3=1310.85*sqrt($2)-312.637::$4=0.01::$5=sqrt(34.63^2 + (1310.85^2 * 0.01^2) / (4 * $2) + $2 * (41.85^2))::$6=($1-(-4))*40::$7=20::$8=-$6

U_0 = -6, K2 = 1
0.81A copper yes:
| U_24,d | I_m,A |     B, mT |   dA |        dB | U, nV | dU | u real talk |
|--------+-------+-----------+------+-----------+-------+----+-------------|
|      1 |  0.23 | 316.02458 | 0.01 | 42.294667 |   280 | 20 |        -280 |
|      6 |  0.40 | 516.41733 | 0.01 | 44.801801 |   480 | 20 |        -480 |
|      9 |  0.55 | 659.51538 | 0.01 | 47.335241 |   600 | 20 |        -600 |
|     11 |  0.65 | 744.20406 | 0.01 | 49.028064 |   680 | 20 |        -680 |
|     15 |  0.81 |   867.128 | 0.01 | 51.680982 |   840 | 20 |        -840 |
|     18 |  1.00 |   998.213 | 0.01 | 54.713962 |   960 | 20 |        -960 |
|     20 |  1.21 |  1129.298 | 0.01 | 57.913390 |  1040 | 20 |       -1040 |
#+TBLFM: $3=1310.85*sqrt($2)-312.637::$4=0.01::$5=sqrt(34.63^2 + (1310.85^2 * 0.01^2) / (4 * $2) + $2 * (41.85^2))::$6=($1-(-6))*40::$7=20::$8=-$6

U_0 = -9, K2 = 1
1.03A copper yes:
| U_24,d | I_m,A |     B, mT |   dA |        dB | U, nV | dU | u real talk |
|--------+-------+-----------+------+-----------+-------+----+-------------|
|     -2 |  0.20 | 273.59294 | 0.01 | 42.003718 |   280 | 20 |        -280 |
|      6 |  0.40 | 516.41733 | 0.01 | 44.801801 |   600 | 20 |        -600 |
|     10 |  0.54 | 650.63709 | 0.01 | 47.165212 |   760 | 20 |        -760 |
|     13 |  0.65 | 744.20406 | 0.01 | 49.028064 |   880 | 20 |        -880 |
|     19 |  0.81 |   867.128 | 0.01 | 51.680982 |  1120 | 20 |       -1120 |
|     22 |  1.00 |   998.213 | 0.01 | 54.713962 |  1240 | 20 |       -1240 |
|     25 |  1.21 |  1129.298 | 0.01 | 57.913390 |  1360 | 20 |       -1360 |
#+TBLFM: $3=1310.85*sqrt($2)-312.637::$4=0.01::$5=sqrt(34.63^2 + (1310.85^2 * 0.01^2) / (4 * $2) + $2 * (41.85^2))::$6=($1-(-9))*40::$7=20::$8=-$6

U_0 = -11, K2 = 1
1.16A copper yes:
| U_24,d | I_m,A |     B, mT |   dA |        dB | U, nV | dU | u real talk |
|--------+-------+-----------+------+-----------+-------+----+-------------|
|     -4 |  0.20 | 273.59294 | 0.01 | 42.003718 |   280 | 20 |        -280 |
|      4 |  0.40 | 516.41733 | 0.01 | 44.801801 |   600 | 20 |        -600 |
|     10 |  0.55 | 659.51538 | 0.01 | 47.335241 |   840 | 20 |        -840 |
|     13 |  0.65 | 744.20406 | 0.01 | 49.028064 |   960 | 20 |        -960 |
|     18 |   0.8 | 859.82288 | 0.01 | 51.517693 |  1160 | 20 |       -1160 |
|     22 |  1.00 |   998.213 | 0.01 | 54.713962 |  1320 | 20 |       -1320 |
|     25 |  1.21 |  1129.298 | 0.01 | 57.913390 |  1440 | 20 |       -1440 |
#+TBLFM: $3=1310.85*sqrt($2)-312.637::$4=0.01::$5=sqrt(34.63^2 + (1310.85^2 * 0.01^2) / (4 * $2) + $2 * (41.85^2))::$6=($1-(-11))*40::$7=20::$8=-$6

U_0 = -27, K2 = 2
1.16A copper yes:
| U_24,d | I_m,A |     B, mT |   dA |        dB | U, nV | dU | u real talk |
|--------+-------+-----------+------+-----------+-------+----+-------------|
|     19 |  0.19 | 258.74927 | 0.01 | 41.929738 |  1840 | 20 |       -1840 |
|     11 |  0.40 | 516.41733 | 0.01 | 44.801801 |  1520 | 20 |       -1520 |
|      5 |  0.55 | 659.51538 | 0.01 | 47.335241 |  1280 | 20 |       -1280 |
|      2 |  0.65 | 744.20406 | 0.01 | 49.028064 |  1160 | 20 |       -1160 |
|     -3 |  0.80 | 859.82288 | 0.01 | 51.517693 |   960 | 20 |        -960 |
|     -8 |  1.01 | 1004.7509 | 0.01 | 54.869905 |   760 | 20 |        -760 |
|    -11 |  1.20 | 1123.3272 | 0.01 | 57.764543 |   640 | 20 |        -640 |
#+TBLFM: $3=1310.85*sqrt($2)-312.637::$4=0.01::$5=sqrt(34.63^2 + (1310.85^2 * 0.01^2) / (4 * $2) + $2 * (41.85^2))::$6=($1-(-27))*40::$7=20::$8=-$6

U_0 = 29, K2 = 1
1.00A zinc yes:
| U_24,d | I_m,A |     B, mT |   dA |        dB | U, nV | dU |
|--------+-------+-----------+------+-----------+-------+----|
|     26 |  0.20 | 273.59294 | 0.01 | 42.003718 |   120 | 20 |
|     21 |  0.40 | 516.41733 | 0.01 | 44.801801 |   320 | 20 |
|     17 |  0.55 | 659.51538 | 0.01 | 47.335241 |   480 | 20 |
|     14 |  0.65 | 744.20406 | 0.01 | 49.028064 |   600 | 20 |
|     11 |  0.80 | 859.82288 | 0.01 | 51.517693 |   720 | 20 |
|      8 |  1.00 |   998.213 | 0.01 | 54.713962 |   840 | 20 |
|      6 |  1.21 |  1129.298 | 0.01 | 57.913390 |   920 | 20 |
#+TBLFM: $3=1310.85*sqrt($2)-312.637::$4=0.01::$5=sqrt(34.63^2 + (1310.85^2 * 0.01^2) / (4 * $2) + $2 * (41.85^2))::$6=($1-(29))*40::$7=20

U_0 = -14, K2 = 2
1.00A zinc yes:
| U_24,d | I_m,A |     B, mT |   dA |        dB | u real talk | dU |
|--------+-------+-----------+------+-----------+-------------+----|
|    -10 |  0.20 | 273.59294 | 0.01 | 42.003718 |         160 | 20 |
|     -4 |  0.40 | 516.41733 | 0.01 | 44.801801 |         400 | 20 |
|     -1 |  0.55 | 659.51538 | 0.01 | 47.335241 |         520 | 20 |
|      2 |  0.65 | 744.20406 | 0.01 | 49.028064 |         640 | 20 |
|      5 |  0.80 | 859.82288 | 0.01 | 51.517693 |         760 | 20 |
|      8 |  1.00 |   998.213 | 0.01 | 54.713962 |         880 | 20 |
|     10 |  1.21 |  1129.298 | 0.01 | 57.913390 |         960 | 20 |
#+TBLFM: $3=1310.85*sqrt($2)-312.637::$4=0.01::$5=sqrt(34.63^2 + (1310.85^2 * 0.01^2) / (4 * $2) + $2 * (41.85^2))::$6=($1-(-14))*40::$7=20

* 13

U_0=7
zinc I=0.99A U=33

U_0=7
copper I=0.99A U=36


-------------------------------------------------------------------------------------

Cu, k(I):
| I, A | k, нВ/мТл |       dk |   dA |
|------+-----------+----------+------|
|  0.2 | -0.263903 |   0.0179 | 0.01 |
|  0.4 |  -0.52265 |  0.01525 | 0.01 |
|  0.6 | -0.751762 | 0.008758 | 0.01 |
| 0.81 | -0.936119 | 0.009926 | 0.01 |
| 1.03 |  -1.21608 |  0.01989 | 0.01 |
| 1.16 |  -1.28902 |  0.02295 | 0.01 |

alpha = 1.16463 +/- 0.02482 (2.131%) нВ / (мТл * A)
R = 5.82315 * 10^(-11) м^3/Кл cock
n = 1.071844164 * 10^29

finally Cu:
R = -(5.82 +/- 0.12) * 10^(-11) м^3/Кл, e = 2.1%
n = (1.072 +/- 0.023) * 10^(29) 1/м^3, e = 2.1%
sigma = (6.40 +/- 0.13) * 10^7 (ohm * m)^-1, e = 2.0%

Zn:
k = 0.848947 +/- 0.01991 (2.345%) нВ / мТл
R = 6.791576 (2.549%)
deltan = 2.342550141

finally Zn:
R = (6.79 +/- 0.17) * 10^(-11) m^3/Кл, e = 2.5%
n = (0.919 +/- 0.023) * 10^(29) 1/м^3, e = 2.5%
sigma = (1.90 +/- 0.04) * 10^7 (ohm * m)^-1, e = 2.2%


#+TBLFM: $6=0.01
